import 'package:get/get_navigation/src/root/internacionalization.dart';

class AppTranslation extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        ///////////////////////////// Language /////////////////////////
        "ar": {
          /////////////Login/////////////
          "1-تسجيل الدخول": "تسجيل الدخول",
          "2-لطفًا  قم بإدخال البيانات التالية لتسجيل دخولك":
              "لطفًا  قم بإدخال البيانات التالية لتسجيل دخولك",
          "3-رمز الدخول": "رمز الدخول",
          "4-تسجيل الدخول الان": "تسجيل الدخول الان",
          "5-انتظر قليلاً يتم تسجيل الدخول  والتاكد من البيانات":
              "انتظر قليلاً يتم تسجيل الدخول  والتاكد من البيانات",

          "6-عزيزي المستخدم تم تسجيل الدخول بنجاح,,قم بالضغط على الزر للتوجة للرئيسية":
              "عزيزي المستخدم تم تسجيل الدخول بنجاح,,قم بالضغط على الزر للتوجة للرئيسية",

          "7-التوجة الان": "التوجة الان",
          "8-عزيزي المستخدم اسم المستخدم او كلمة المرور خاطئة,,الرجاء التاكد من صحتهم":
              "عزيزي المستخدم اسم المستخدم او كلمة المرور خاطئة,,الرجاء التاكد من صحتهم",
          "9-الاخفاء": "الاخفاء",

          ////////////////........####Save Location.................................................////////

          "10-اضغط على الزر لحفظ  موقعك الحالي لعرض الطلبات القريبة منك..":
              "اضغط على الزر لحفظ  موقعك الحالي لعرض الطلبات القريبة منك..",
          "11-فحص وحفظ الموقع": "فحص وحفظ الموقع",

////////////////////////////..........................Orders List...........................//////
          "12-الطلبات المتوفرة": "الطلبات المتوفرة",
          "13-لاتمتلك اي طلبيات لعرضها": "لاتمتلك اي طلبيات لعرضها",
          "14-نوع الخدمة:": "نوع الخدمة:",
          "15-رقم هذة الطلبية:": "رقم هذة الطلبية:",
          "16-إجمالي سعر هذة الطلبية:": "إجمالي سعر هذة الطلبية:",
          "17-تفاصيل الطلبية": "تفاصيل الطلبية",
          "18-مشاهدة التفاصيل": "مشاهدة التفاصيل",
          "19-يتم التحميل": "يتم التحميل",
/////////////////////////////////// My Orders List.......................////////////
          "20-طلبياتك المختارة": "طلبياتك المختارة",

          //////////////////////////................Menu........................../////////////
          "21-الطلبات العامة": "الطلبات العامة",
          "22-طلباتك": "طلباتك",
          "23-الاعدادت": "الاعدادت",

          /////////////////////////.................Orders Details......................../////////
          "24-التفاصيل النهائية للطلبية": "التفاصيل النهائية للطلبية",
          "25-استلام العمل": "استلام العمل",
          "26-التفاصيل العامة": "التفاصيل العامة",
          "27-نوع الخدمة:": "نوع الخدمة:",
          "28-رقم الطلبية:": "رقم الطلبية:",
          "29-إجمالي الطلبية:": "إجمالي الطلبية:",
          "30-تفاصيل أنواع الخدمة المقدمة": "تفاصيل أنواع الخدمة المقدمة",
          "31-لاتمتلك اي تفرعات لعرضها": "لاتمتلك اي تفرعات لعرضها",
          "32-عملية الجدولة": "عملية الجدولة",
          "33-هذه هي الجدولة التى تم إختيارها ":
              "هذه هي الجدولة التى تم إختيارها ",
          "34-تاريخ الجدولة المُدخل:": "105-تاريخ الجدولة المُدخل:",
          "35-وقت الجدولة المُدخل:": "وقت الجدولة المُدخل:",
          "36-آلية الدفع": "آلية الدفع",
          "37-هذة الألية المُختارة لعملية الدفع مقابل الخدمة":
              "هذة الألية المُختارة لعملية الدفع مقابل الخدمة",
          "38-آلية الدفع المُختارة:": "آلية الدفع المُختارة:",
          "39-دفع كاش-نقدي": "دفع كاش-نقدي",
          "40-دفع عبر البطاقة-إلكتروني": "دفع عبر البطاقة-إلكتروني",
          "41-الموقع": "الموقع",
          "43-الموقع الذي سيتم تقديم الخدمة فيه":
              "الموقع الذي سيتم تقديم الخدمة فيه",
          "44-مشاهدة الموقع": "مشاهدة الموقع",
          "45-تفاصيل أخرى": "تفاصيل أخرى",
          "46-التفاصيل الإضافية(نص مُدخل-صورة مُدخلة) حسب الرغبة":
              "التفاصيل الإضافية(نص مُدخل-صورة مُدخلة) حسب الرغبة",

          //////////////////////More..................My Orders Details............///////////////
          "47-تفاصيل حول مزود الخدمة": "تفاصيل حول مزود الخدمة",
          "48-ارسال أشعار الوصول للموقع": "ارسال أشعار الوصول للموقع",
          "49-تم العمل": "تم العمل",
          "50-الخدمات الإضافية المقدمة لهذة الطلبية":
              "الخدمات الإضافية المقدمة لهذة الطلبية",
          "51-لايوجد بيانات": "لايوجد بيانات",
          "52-السعر الجديد": "السعر الجديد",
          "53-تم العمل مع السعر الجديد": "تم العمل مع السعر الجديد",
          "54-التاجيل-او الالغاء": "التاجيل-او الالغاء",
          "55-تاجيل الموعد": "تاجيل الموعد",
          "56-إلغاء العمل": "إلغاء العمل",

          //////////////////////////////........Settings......................................../////////
          "60-الإعدادت": "الإعدادت",
          "61-معلومات الحساب": "معلومات الحساب",
          "62-موقعي": "موقعي",
          "63-اللغة": "اللغة",
          "64-تسجيل خروج": "تسجيل خروج",

          ////////////////...............Info............................................................../
          "65-معلومات الحساب": "معلومات الحساب",
          "66-الاسم:": "الاسم:",
          "67-رقم الهاتف:": "رقم الهاتف:",
          "68-الخدمة المقدمة:": "الخدمة المقدمة:",

          ///////////Lang choose............../////////
          "70-قم بإختيار اللغة المناسبة لك من الخيارات التالية":
              "قم بإختيار اللغة المناسبة لك من الخيارات التالية",
          "71-اللغة العربية-الأختيار": "اللغة العربية-الأختيار",
          "72-اللغة الاردية-الأختيار": "اللغة الاردية-الأختيار",
          "73-اللغة البنغلادشية-الأختيار": "اللغة البنغلادشية-الأختيار",
          "74-الإنتقال": "الإنتقال",
          "75-تم الحفظ بنجاح": "تم الحفظ بنجاح",
          "76-الانتقال الان": "الانتقال الان",
          "77-مهمة أخرى": "مهمة أخرى",
          "80-المبلغ في المحفظة:": "المبلغ في المحفظة:",
          "81-نسبة العمولة :": "نسبة العمولة :"
        },

        "bi": {
          "1-تسجيل الدخول": "لاگ ان کریں",
          "2-لطفًا  قم بإدخال البيانات التالية لتسجيل دخولك":
              "برائے مہربانی اپنا لاگ ان کرنے کے لئے مندرجہ ذیل تفصیلات درج کریں",
          "3-رمز الدخول": "لاگ ان کوڈ",
          "4-تسجيل الدخول الان": "ابھی لاگ ان کریں",
          "5-انتظر قليلاً يتم تسجيل الدخول  والتاكد من البيانات":
              "تھوڑی دیر انتظار کریں ، لاگ ان ہو رہا ہے اور تفصیلات کی تصدیق ہو رہی ہے",
          "6-عزيزي المستخدم تم تسجيل الدخول بنجاح,,قم بالضغط على الزر للتوجة للرئيسية":
              "عزیز صارف ، آپ کامیابی کے ساتھ لاگ ان ہو گئے ہیں ، مرکزی صفحہ پر جانے کے لئے بٹن پر کلک کریں",
          "7-التوجة الان": "ابھی جائیں",
          "8-عزيزي المستخدم اسم المستخدم او كلمة المرور خاطئة,,الرجاء التاكد من صحتهم":
              "عزیز صارف ، آپ کا صارف نام یا پاس ورڈ غلط ہے ، برائے مہربانی ان کی درستگی کی تصدیق کریں",
          "9-الاخفاء": "چھپائیں",
          "10-اضغط على الزر لحفظ  موقعك الحالي لعرض الطلبات القريبة منك..":
              "اپنے موجودہ مقام کو محفوظ کرنے اور اپنے قریب کے آرڈرز دیکھنے کے لئے بٹن پر دبائیں ..",
          "11-فحص وحفظ الموقع": "مقام کی جانچ اور محفوظ کریں",
          "12-الطلبات المتوفرة": "دستیاب آرڈرز",
          "13-لاتمتلك اي طلبيات لعرضها":
              "آپ کے پاس کوئی آرڈر نہیں ہیں جنہیں دکھایا جا سکے",
          "14-نوع الخدمة:": "خدمت کی قسم:",
          "15-رقم هذة الطلبية:": "اس آرڈر کا نمبر:",
          "16-إجمالي سعر هذة الطلبية:": "اس آرڈر کی کل قیمت:",
          "17-تفاصيل الطلبية": "آرڈر کی تفصیلات",
          "18-مشاهدة التفاصيل": "تفصیلات دیکھیں",
          "19-يتم التحميل": "لوڈ ہو رہا ہے",
          "20-طلبياتك المختارة": "آپ کے منتخب آرڈرز",
          "21-الطلبات العامة": "عام آرڈرز",
          "22-طلباتك": "آپ کے آرڈرز",
          "23-الاعدادت": "ترتیبات",
          "24-التفاصيل النهائية للطلبية": "آرڈر کی حتمی تفصیلات",
          "25-استلام العمل": "کام کی وصولی",
          "26-التفاصيل العامة": "عام تفصیلات",
          "27-نوع الخدمة:": "خدمت کی قسم:",
          "28-رقم الطلبية:": "آرڈر کا نمبر:",
          "29-إجمالي الطلبية:": "آرڈر کی کل رقم:",
          "30-تفاصيل أنواع الخدمة المقدمة":
              "مہیا کردہ خدمات کی اقسام کی تفصیلات",
          "31-لاتمتلك اي تفرعات لعرضها":
              "آپ کے پاس کوئی شاخیں نہیں ہیں جنہیں دکھایا جا سکے",
          "32-عملية الجدولة": "شیڈولنگ کا عمل",
          "33-هذه هي الجدولة التى تم إختيارها ":
              "یہ وہ شیڈول ہے جسے آپ نے منتخب کیا ہے ",
          "34-تاريخ الجدولة المُدخل:": "105-داخل کردہ شیڈول کی تاریخ:",
          "35-وقت الجدولة المُدخل:": "داخل کردہ شیڈول کا وقت:",
          "36-آلية الدفع": "ادائیگی کا طریقہ",
          "37-هذة الألية المُختارة لعملية الدفع مقابل الخدمة":
              "یہ وہ طریقہ ہے جسے آپ نے خدمت کے بدلے ادائیگی کے لئے منتخب کیا ہے",
          "38-آلية الدفع المُختارة:": "منتخب کردہ ادائیگی کا طریقہ:",
          "39-دفع كاش-نقدي": "نقد ادائیگی",
          "40-دفع عبر البطاقة-إلكتروني": "کارڈ کے ذریعے ادائیگی",
          "41-الموقع": "مقام",
          "43-الموقع الذي سيتم تقديم الخدمة فيه":
              "وہ مقام جہاں خدمت فراہم کی جائے گی",
          "44-مشاهدة الموقع": "مقام دیکھیں",
          "45-تفاصيل أخرى": "دیگر تفصیلات",
          "46-التفاصيل الإضافية(نص مُدخل-صورة مُدخلة) حسب الرغبة":
              "اضافی تفصیلات (درج کردہ متن-درج کردہ تصویر) حسب خواہش",
          "47-تفاصيل حول مزود الخدمة":
              "خدمت فراہم کرنے والے کے بارے میں تفصیلات",
          "48-ارسال أشعار الوصول للموقع": "مقام تک رسائی کا اطلاع بھیجیں",
          "49-تم العمل": "کام ہو گیا",
          "50-الخدمات الإضافية المقدمة لهذة الطلبية":
              "اس آرڈر کے لئے فراہم کردہ اضافی خدمات",
          "51-لايوجد بيانات": "کوئی ڈیٹا نہیں ہے",
          "52-السعر الجديد": "نیا قیمت",
          "53-تم العمل مع السعر الجديد": "نئی قیمت کے ساتھ کام ہو گیا",
          "54-التاجيل-او الالغاء": "تاخیر-یا منسوخی",
          "55-تاجيل الموعد": "ملاقات کی تاخیر",
          "56-إلغاء العمل": "کام منسوخ کریں",
          "60-الإعدادت": "ترتیبات",
          "61-معلومات الحساب": "اکاؤنٹ کی معلومات",
          "62-موقعي": "میرا مقام",
          "63-اللغة": "زبان",
          "64-تسجيل خروج": "لاگ آؤٹ",
          "65-معلومات الحساب": "اکاؤنٹ کی معلومات",
          "66-الاسم:": "نام:",
          "67-رقم الهاتف:": "فون نمبر:",
          "68-الخدمة المقدمة:": "فراہم کردہ خدمت:",
          ///////////////////////////////

          "70-قم بإختيار اللغة المناسبة لك من الخيارات التالية":
              "مناسب زبان کا انتخاب کریں مندرجہ ذیل اختیارات میں سے",
          "71-اللغة العربية-الأختيار": "عربی زبان-انتخاب",
          "72-اللغة الاردية-الأختيار": "اردو زبان-انتخاب",
          "73-اللغة البنغلادشية-الأختيار": "بنگلہ زبان-انتخاب",
          "74-الإنتقال": "منتقلی",
          "75-تم الحفظ بنجاح": "کامیابی کے ساتھ محفوظ ہو گیا",
          "76-الانتقال الان": "اب منتقل ہوں",
          "77-مهمة أخرى": "دوسرا کام",
          "80-المبلغ في المحفظة:": "محفظے میں رقم:",
          "81-نسبة العمولة :": "کمیشن کی شرح:",
        },
        "be": {
          "1-تسجيل الدخول": "লগ ইন করুন",
          "2-لطفًا  قم بإدخال البيانات التالية لتسجيل دخولك":
              "দয়া করে আপনার লগইন করার জন্য নিম্নলিখিত তথ্য প্রবেশ করান",
          "3-رمز الدخول": "লগইন কোড",
          "4-تسجيل الدخول الان": "এখন লগইন করুন",
          "5-انتظر قليلاً يتم تسجيل الدخول  والتاكد من البيانات":
              "একটু অপেক্ষা করুন, লগইন হচ্ছে এবং তথ্যগুলি যাচাই করা হচ্ছে",
          "6-عزيزي المستخدم تم تسجيل الدخول بنجاح,,قم بالضغط على الزر للتوجة للرئيسية":
              "প্রিয় ব্যবহারকারী, আপনি সফলভাবে লগইন করেছেন, মূল পৃষ্ঠায় যাওয়ার জন্য বাটনে ক্লিক করুন",
          "7-التوجة الان": "এখন যান",
          "8-عزيزي المستخدم اسم المستخدم او كلمة المرور خاطئة,,الرجاء التاكد من صحتهم":
              "প্রিয় ব্যবহারকারী, আপনার ব্যবহারকারীর নাম বা পাসওয়ার্ড ভুল, দয়া করে তাদের সঠিকতা যাচাই করুন",
          "9-الاخفاء": "লুকান",
          "10-اضغط على الزر لحفظ  موقعك الحالي لعرض الطلبات القريبة منك..":
              "আপনার বর্তমান অবস্থান সংরক্ষণ করতে এবং আপনার কাছাকাছি অর্ডারগুলি দেখতে বাটনে চাপুন ..",
          "11-فحص وحفظ الموقع": "অবস্থান পরীক্ষা এবং সংরক্ষণ করুন",
          "12-الطلبات المتوفرة": "উপলব্ধ অর্ডার",
          "13-لاتمتلك اي طلبيات لعرضها":
              "আপনার কোনও অর্ডার নেই যা প্রদর্শন করা যায়",
          "14-نوع الخدمة:": "সেবার ধরণ:",
          "15-رقم هذة الطلبية:": "এই অর্ডারের নম্বর:",
          "16-إجمالي سعر هذة الطلبية:": "এই অর্ডারের মোট দাম:",
          "17-تفاصيل الطلبية": "অর্ডারের বিশদ বিবরণ",
          "18-مشاهدة التفاصيل": "বিস্তারিত দেখুন",
          "19-يتم التحميل": "লোড হচ্ছে",
          "20-طلبياتك المختارة": "আপনার নির্বাচিত অর্ডার",
          "21-الطلبات العامة": "সাধারণ অর্ডার",
          "22-طلباتك": "আপনার অর্ডার",
          "23-الاعدادت": "সেটিংস",
          "24-التفاصيل النهائية للطلبية": "অর্ডারের চূড়ান্ত বিবরণ",
          "25-استلام العمل": "কাজ গ্রহণ",
          "26-التفاصيل العامة": "সাধারণ বিবরণ",
          "27-نوع الخدمة:": "সেবার ধরণ:",
          "28-رقم الطلبية:": "অর্ডার নম্বর:",
          "29-إجمالي الطلبية:": "অর্ডারের মোট:",
          "30-تفاصيل أنواع الخدمة المقدمة": "প্রদত্ত সেবার ধরণের বিশদ বিবরণ",
          "31-لاتمتلك اي تفرعات لعرضها":
              "আপনার কোনও শাখা নেই যা প্রদর্শন করা যায়",
          "32-عملية الجدولة": "সময়সূচী প্রক্রিয়া",
          "33-هذه هي الجدولة التى تم إختيارها ":
              "এটি সেই সময়সূচী যা আপনি নির্বাচন করেছেন ",
          "34-تاريخ الجدولة المُدخل:": "প্রবেশ করানো সময়সূচীর তারিখ:",
          "35-وقت الجدولة المُدخل:": "প্রবেশ করানো সময়সূচীর সময়:",
          "36-آلية الدفع": "পেমেন্ট পদ্ধতি",
          "37-هذة الألية المُختارة لعملية الدفع مقابل الخدمة":
              "এটি সেই পদ্ধতি যা আপনি সেবার বিনিময়ে পেমেন্ট করার জন্য নির্বাচন করেছেন",
          "38-آلية الدفع المُختارة:": "নির্বাচিত পেমেন্ট পদ্ধতি:",
          "39-دفع كاش-نقدي": "নগদ পেমেন্ট",
          "40-دفع عبر البطاقة-إلكتروني": "কার্ডের মাধ্যমে পেমেন্ট",
          "41-الموقع": "অবস্থান",
          "43-الموقع الذي سيتم تقديم الخدمة فيه":
              "সেই অবস্থান যেখানে সেবা প্রদান করা হবে",
          "44-مشاهدة الموقع": "লোকেশন দেখুন",
          "45-تفاصيل أخرى": "অন্যান্য বিস্তারিত",
          "46-التفاصيل الإضافية(نص مُدخل-صورة مُدخلة) حسب الرغبة":
              "অতিরিক্ত বিবরণ (ইনপুট টেক্সট-ইনপুট ইমেজ) ইচ্ছানুযায়ী",
          "47-تفاصيل حول مزود الخدمة": "সেবা প্রদানকারীর সম্পর্কে বিস্তারিত",
          "48-ارسال أشعار الوصول للموقع": "লোকেশনে পৌঁছার নোটিফিকেশন পাঠান",
          "49-تم العمل": "কাজ সম্পন্ন",
          "50-الخدمات الإضافية المقدمة لهذة الطلبية":
              "এই অর্ডারের জন্য প্রদত্ত অতিরিক্ত সেবা",
          "51-لايوجد بيانات": "কোনও ডেটা নেই",
          "52-السعر الجديد": "নতুন দাম",
          "53-تم العمل مع السعر الجديد": "নতুন দামের সাথে কাজ সম্পন্ন",
          "54-التاجيل-او الالغاء": "বিলম্ব-বা বাতিল",
          "55-تاجيل الموعد": "মিটিং বিলম্ব",
          "56-إلغاء العمل": "কাজ বাতিল করুন",
          "60-الإعدادت": "সেটিংস",
          "61-معلومات الحساب": "অ্যাকাউন্টের তথ্য",
          "62-موقعي": "আমার লোকেশন",
          "63-اللغة": "ভাষা",
          "64-تسجيل خروج": "লগ আউট",
          "65-معلومات الحساب": "অ্যাকাউন্টের তথ্য",
          "66-الاسم:": "নাম:",
          "67-رقم الهاتف:": "ফোন নম্বর:",
          "68-الخدمة المقدمة:": "প্রদত্ত সেবা:",

          ///////////////////

          "70-قم بإختيار اللغة المناسبة لك من الخيارات التالية":
              "আপনি যে ভাষা নির্বাচন করতে চান, তা নির্বাচন করুন",
          "71-اللغة العربية-الأختيار": "আরবি-চয়ন করুন",
          "72-اللغة الاردية-الأختيار": "উর্দু-চয়ন করুন",
          "73-اللغة البنغلادشية-الأختيار": "বাংলা-চয়ন করুন",
          "74-الإنتقال": "সাময়িক",
          "75-تم الحفظ بنجاح": "সফলভাবে সংরক্ষিত",
          "76-الانتقال الان": "এখন যান",
          "77-مهمة أخرى": "অন্যান্য কাজ",

          "80-المبلغ في المحفظة:": "মানিব্যাগে টাকা:",
          "81-نسبة العمولة :": "কমিশনের হার:",
        }
      };
}
